VPro/src/Documents/LoanInterestCommissionAccruals/LoanInterestCommissionAccruals.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LoanInterestCommissionAccruals</name>
  <registerRecords>AccountingRegister.Managerial</registerRecords>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccumulationRegister.LoanSettlements</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>OperationType</name>
    <type>
      <types>EnumRef.LoanAccrualTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Accruals</name>
    <attributes>
      <name>AmountType</name>
      <type>
        <types>EnumRef.LoanScheduleAmountTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Lender</name>
      <type>
        <types>CatalogRef.Counterparties</types>
      </type>
    </attributes>
    <attributes>
      <name>LoanContract</name>
      <type>
        <types>DocumentRef.LoanContract</types>
      </type>
    </attributes>
    <attributes>
      <name>SettlementsCurrency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

VPro/src/Enums/LoanAccrualTypes/LoanAccrualTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoanAccrualTypes</name>
  <enumValues>
    <name>AccrualsForEmployeeLoans</name>
  </enumValues>
  <enumValues>
    <name>AccrualsForLoansBorrowed</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Documents/LoanInterestCommissionAccruals/ObjectModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then

#Region EventHandlers

Procedure Filling(FillingData, StandardProcessing)
	
	AccrualPeriod = New StandardPeriod;
	AccrualPeriod.Variant	= StandardPeriodVariant.LastMonth;
	StartDate				= AccrualPeriod.StartDate;
	EndDate					= AccrualPeriod.EndDate;
	
	ObjectFillingSB.FillDocument(ThisObject, FillingData);
	
EndProcedure

// Procedure - handler of the PostingProcessing event of the object.
//
Procedure Posting(Cancel, PostingMode)
	
	// Initialization of additional properties to post the document
	SmallBusinessServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Document data initialization
	Documents.LoanInterestCommissionAccruals.InitializeDocumentData(Ref, AdditionalProperties);
	
	// Prepare record sets
	SmallBusinessServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Record in accounting sections
	SmallBusinessServer.ReflectIncomeAndExpenses(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectManagerial(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectLoanSettlements(AdditionalProperties, RegisterRecords, Cancel);
	
	// Record of record sets
	SmallBusinessServer.WriteRecordSets(ThisObject);

	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
	
EndProcedure

// Procedure - handler of the PopulationCheckProcessing event of the object.
//
Procedure FillCheckProcessing(Cancel, AttributesToCheck)
	
	If OperationType = Enums.LoanAccrualTypes.AccrualsForLoansBorrowed Then		
		SmallBusinessServer.DeleteAttributeBeingChecked(AttributesToCheck, "Accruals.Employee");		
	Else		
		SmallBusinessServer.DeleteAttributeBeingChecked(AttributesToCheck, "Accruals.Lender");		
	EndIf;
	
	If ValueIsFilled(StartDate) AND ValueIsFilled(EndDate)
		AND StartDate > EndDate Then
		
		MessageText = NStr("en='Incorrect period is specified. Start date > End date.';ru='Указан неверный период. Дата начала > Даты окончания!.';vi='Đã chỉ ra sai kỳ. Ngày bắt đầu > Ngày kết thúc!'");
		
		SmallBusinessServer.ShowMessageAboutError(
			ThisObject,
			MessageText,,,
			"StartDate",
			Cancel);
		
	EndIf;
	
EndProcedure

// Procedure - handler of the PostingDeletionProcessing of the object event.
//
Procedure UndoPosting(Cancel)
	
	// Initialization of additional properties to post the document
	SmallBusinessServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Prepare record sets
	SmallBusinessServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Record of record sets
	SmallBusinessServer.WriteRecordSets(ThisObject);

EndProcedure

// Procedure - handler of the BeforeWriting event of the object.
//
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
EndProcedure // BeforeWriting()

#EndRegion

#EndIf
